/**
 * 校验数字
 */
//非负整数
var pNum =/^\d+$ 或 ^[1-9]\d*|0$/g;
//非正整数
var nNum =/^-[1-9]\d*|0$ 或 ^((-\d+)|(0+))$/g;
//非负浮点数
var pDob=/^\d+(\.\d+)?$ 或 ^[1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0$/g;
//非正浮点数
var nDob =/^((-\d+(\.\d+)?)|(0+(\.0+)?))$ 或 ^(-([1-9]\d*\.\d*|0\.\d*[1-9]\d*))|0?\.0+|0$/g;
//正浮点数
var pDouble =/^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$ 或 ^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$/g;
//负浮点数
var nDouble =/^-([1-9]\d*\.\d*|0\.\d*[1-9]\d*)$ 或 ^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$/g;
//浮点数
var Double =/^(-?\d+)(\.\d+)?$ 或 ^-?([1-9]\d*\.\d*|0\.\d*[1-9]\d*|0?\.0+|0)$/g;

/**
 * 校验字符
 */
//汉字
var zh =/^[\u4e00-\u9fa5]{0,}$/g;
//由26个英文字母组成的字符串
var letter =/^[A-Za-z]+$/g;
//由26个大写英文字母组成的字符串
var upLetter =/^[A-Z]+$/g;
//由26个小写英文字母组成的字符串
var loLetter =/^[a-z]+$/g;
//由数字和26个英文字母组成的字符串
var letterNum =/^[A-Za-z0-9]+$/g;
//由数字、26个英文字母或者下划线组成的字符串
var enAll =/^\w{3,20}$/g;
//中文、英文、数字包括下划线
var zhAll =/^[\u4E00-\u9FA5A-Za-z0-9_]+$/g;
//中文、英文、数字但不包括下划线等符号
var zhAll_ =/^[\u4E00-\u9FA5A-Za-z0-9]+$ 或 ^[\u4E00-\u9FA5A-Za-z0-9]{2,20}$/g;
//可以输入含有^%&',;=?$\"等字符
var special =/[^%&',;=?$\x22]+/g;
//禁止输入含有~的字符
var forbid =/[^~\x22]+/g;

/**
 * 特殊需求表达式
 */
//Email地址
var email =/^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/g;
//域名
var domain =/[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(\/.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+\/.?/g;
//InternetURL
var URL =/^http:\/\/([\w-]+\.)+[\w-]+(\/[\w-./?%&=]*)?$/g;
var URL1=/[a-zA-z]+:\/\/[^\s]*/g;
//手机号码
var mobile =/^(13[0-9]|14[5|7]|15[0|1|2|3|5|6|7|8|9]|18[0|1|2|3|5|6|7|8|9])\d{8}$/g;
//电话号码XXX-XXXXXXX
//var phone =/^(\(\d{3,4}-)|\d{3.4}-)?\d{7,8}$/g;
//国内电话号码(0511-4405222、021-87888822)
var zhPhone =/\d{3}-\d{8}|\d{4}-\d{7}/g;
//15或18位身份证
var IDcard =/^\d{15}|\d{18}$/g;
//15位身份证
var IDcard15 =/^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/g;
//18位身份证
var IDcard18 =/^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{4}$/g;
//短身份证号码(数字、字母x结尾)
var IDcardx =/^([0-9]){7,18}(x|X)?$ 或 ^\d{8,18}|[0-9x]{8,18}|[0-9X]{8,18}?$/g;
//帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线)
var account =/^[a-zA-Z][a-zA-Z0-9_]{4,15}$/g;
//密码(以字母开头，长度在6~18之间，只能包含字母、数字和下划线)
var pwd =/^[a-zA-Z]\w{5,17}$/g;
//强密码(必须包含大小写字母和数字的组合，不能使用特殊字符，长度在8-10之间)
var Spwd =/^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$/g;
//日期格式
var date =/^\d{4}-\d{1,2}-\d{1,2}/g;
//一年的12个月(01～09和1～12)
var month =/^(0?[1-9]|1[0-2])$/g;
//一个月的31天(01～09和1～31)
var days =/^((0?[1-9])|((1|2)[0-9])|30|31)$/g;
//钱的输入格式："10000.00" 和 "10,000.00", 和没有 "分" 的 "10000" 和 "10,000"
var moneyFormat =/^[1-9][0-9]*$/g;
//任意一个不以0开头的数字
var n0Num =/^(0|[1-9][0-9]*)$/g;
//一个0或者一个不以0开头的数字.我们还可以允许开头有一个负号
var ONum =/^(0|-?[1-9][0-9]*)$/g;
//表示一个0或者一个可能为负的开头不为0的数字.让用户以0开头
var pMoney =/^[0-9]+(.[0-9]+)?$/g;
//必须说明的是,小数点后面至少应该有1位数,所以"10."是不通过的,但是 "10" 和 "10.2" 是通过的
var dobMoney =/^[0-9]+(.[0-9]{2})?$/g;
//这样就允许用户只写一位小数.下面我们该考虑数字中的逗号了,我们可以这样
var dob3Money =/^[0-9]{1,3}(,[0-9]{3})*(.[0-9]{1,2})?$/g;
// xml文件
var xml =/^([a-zA-Z]+-?)+[a-zA-Z0-9]+\\.[x|X][m|M][l|L]$/g;
//中文字符的正则表达式
var zhCharset =/[\u4e00-\u9fa5]/g;
//双字节字符：[^\x00-\xff]    (包括汉字在内，可以用来计算字符串的长度(一个双字节字符长度计2，ASCII字符计1))
var boubleCharset =/[^\x00-\xff]/g;
//空白行的正则表达式
var blankLine =/\n\s*\r/g;
//HTML标记的正则表达式：待验证
var html =/<(\S*?)[^>]*>.*?<\/\1>|<.*?\/>/g;
//以用来删除行首行尾的空白字符(包括空格、制表符、换页符等等)，非常有用的表达式
var trim =/^\s*|\s*$或(^\s*)|(\s*$)/g;
//

//

